In [1]:
import os
import sqlite3
os.getcwd()

'C:\\Users\\Tanvi Shinde'

#CREAT AND CONNECT DATABASE

In [3]:
connection = sqlite3.connect('TanviS.db')
crsr = connection.cursor()

In [4]:
# Creat A Table

In [5]:
sql_command="""
    CREATE TABLE IF NOT EXISTS Ages (
        name VARCHAR(128),
        age INTEGER
    );"""
crsr.execute(sql_command)

In [6]:
#Delete Everything from Table (Ages)

In [7]:
crsr.execute('DELETE FROM Ages')

In [8]:
#Fetch Data from Table (Now table will be blank due to delete query in previous cell)

In [9]:
crsr.execute("SELECT * FROM Ages")
data=crsr.fetchall()
for j in data:
  print(i)

In [10]:
#Insert Data in table

In [11]:
sql_command="""INSERT INTO Ages VALUES ('Mara', 28);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Otto', 33);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Fyn', 31);"""
crsr.execute(sql_command)
sql_command="""INSERT INTO Ages VALUES ('Neshawn', 17);"""
crsr.execute(sql_command)
connection.commit()

In [12]:
#Fetch the data in table

In [13]:
crsr.execute("SELECT * FROM Ages")
data=crsr.fetchall()
for i in data:
  print(i)

('Mara', 28)
('Otto', 33)
('Fyn', 31)
('Neshawn', 17)

In [15]:
#SQL Command

In [16]:
crsr.execute("SELECT hex(name || age) AS X FROM Ages ORDER BY X")
result_set=crsr.fetchall()
for k in data:
  print(k)

('Mara', 28)
('Otto', 33)
('Fyn', 31)
('Neshawn', 17)

In [17]:
#Find first row and result the recorded set

In [18]:
# Find and print the first row
if result_set:
    first_row = result_set[0][0]
    print("The first row in the resulting record set:", first_row)
connection.close()

The first row in the resulting record set: 46796E3331

In [19]:
long_string="53656C696E613333"